# CreateRadioButton2

## Description
Create a radio button with icon.

```pascal
PROCEDURE CreateRadioButton2(
				dialogID    : LONGINT;
				itemID      : LONGINT;
				text        : DYNARRAY[] of CHAR;
				iconResPath : DYNARRAY[] of CHAR);
```

```python
def vs.CreateRadioButton2(dialogID, itemID, text, iconResPath):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|The ID of the dialog.|
|itemID|LONGINT|The ID of the control.|
|text|DYNARRAY[] of CHAR|The text of the control.|
|iconResPath|DYNARRAY[] of CHAR|The resource path of the icon.|

## Examples
```pascal
CreateRadioButton2(1, 2, text, iconResPath);
```
```python
import vs

# Create a radio button with icon.
dialogID = 1
itemID = 2
text = 'Example text'
iconResPath = 'C:/Temp'

vs.CreateRadioButton2(dialogID, itemID, text, iconResPath)
newObj = vs.LNewObj()  # handle to the newly created object
```

## Version
Availability: from Vectorworks 2023

## Category
* Dialogs - Modern